In [1]:
import pandas as pd
import numpy as np

In [8]:
directory = "C:/Users/42111/Desktop/DataScience/analysis/archive/dataScience365/3_1_index2018/Index2018.csv"
raw_data = pd.read_csv(directory)
df_copy = raw_data.copy()
df_copy.head()

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25
3  12/01/1994  474.17  2182.06  3372.02  18793.88
4  13/01/1994  472.47  2142.37  3360.01  18577.26

In [9]:
df_copy.describe()

               spx           dax         ftse        nikkei
count  6269.000000   6269.000000  6269.000000   6269.000000
mean   1288.127542   6080.063363  5422.713545  14597.055700
std     487.586473   2754.361032  1145.572428   4043.122953
min     438.920000   1911.700000  2876.600000   7054.980000
25%     990.671905   4069.350000  4486.100000  10709.290000
50%    1233.420000   5773.340000  5662.430000  15028.170000
75%    1459.987747   7443.070000  6304.250000  17860.470000
max    2872.867839  13559.600000  7778.637689  24124.150000

In [10]:
df_copy['date'].describe()

count           6269
unique          6269
top       07/01/1994
freq               1
Name: date, dtype: object

Top date does not hold the highest value, nor the highest frequency. All values are taken as 1, so any of the date values are in fact the top value, which is of course wrong.

# Converting into a date
---

In [11]:
df_copy['date'] = pd.to_datetime(df_copy['date'], dayfirst=True)

In [7]:
df_copy['date'].describe()

C:\Users\42111\AppData\Local\Temp/ipykernel_1080/2399389818.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  df_copy['date'].describe()

count                    6269
unique                   6269
top       1994-01-07 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

Setting the date as our index

In [12]:
df_copy.set_index('date', inplace=True)
df_copy.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

## Setting the frequency

In [16]:
df_copy = df_copy.asfreq('b')
df_copy.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

Values of the argument can be:
- 'h': hourly
- 'd': daily
- **'b': Business days**
- 'w': weekly
- 'm': monthly
- 'a': annual

if we were to change b for d, we would've gotten na values for every weekend

## Handling Missing Values

In [18]:
df_copy.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

When the frequency was changed, new values were aggregated, adding 8 na in each colummn

In [19]:
df_copy['spx'].fillna(method='ffill', inplace=True)

In [21]:
for column in df_copy:
    df_copy[column].fillna(method='bfill', inplace=True)

In [22]:
df_copy.isna().sum()

spx       0
dax       0
ftse      0
nikkei    0
dtype: int64

## Splitting DAX Stock market from the dataset

In [25]:
dax_df = df_copy.copy()['dax'].to_frame()

In [26]:
dax_df.head()

                dax
date
1994-01-07  2224.95
1994-01-10  2225.00
1994-01-11  2228.10
1994-01-12  2182.06
1994-01-13  2142.37

In [27]:
size = int(len(dax_df) * 0.8)
df_train = dax_df.iloc[:size]
df_test = dax_df.iloc[size:]
df_train.tail()

                dax
date
2013-04-01  7795.31
2013-04-02  7943.87
2013-04-03  7874.75
2013-04-04  7817.39
2013-04-05  7658.75

In [28]:
df_test.head()

                dax
date
2013-04-08  7662.64
2013-04-09  7637.51
2013-04-10  7810.63
2013-04-11  7871.63
2013-04-12  7744.77